#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```


module.synology.module.minio.minio_s3_bucket.bucket["state_infinity_gauntlet_prometheus"]: Refreshing state... [id=state-infinity-gauntlet-prometheus]
module.synology.module.minio.minio_s3_bucket.bucket["state_infinity_gauntlet_etcd"]: Refreshing state... [id=state-infinity-gauntlet-etcd]
module.synology.module.minio.minio_s3_bucket.bucket["state_infinity_gauntlet_longhorn"]: Refreshing state... [id=state-infinity-gauntlet-longhorn]
module.synology.module.minio.minio_s3_bucket.bucket["tftp_netboot_infinity_gauntlet"]: Refreshing state... [id=tftp-netboot-infinity-gauntlet]
module.kubernetes.module.infinity-gauntlet.module.services.module.longhorn.helm_release.longhorn: Refreshing state... [id=longhorn]
module.kubernetes.module.infinity-gauntlet.module.services.module.pi-hole-exporter.kubernetes_namespace.namespace: Refreshing state... [id=pi-hole-exporter]
module.kubernetes.module.infinity-gauntlet.module.nodes.module.netboot.minio_s3_object.node_k3os_config["mind"]: Refreshing state... [id=config/e4:5f:01:27:c8:af.yaml]
module.kubernetes.module.infinity-gauntlet.module.namespaces.kubernetes_namespace.namespace["zerotier"]: Refreshing state... [id=zerotier]
module.kubernetes.module.infinity-gauntlet.module.services.module.default-backend.helm_release.default-backend: Refreshing state... [id=default-backend]
module.kubernetes.module.infinity-gauntlet.module.namespaces.kubernetes_namespace.namespace["terraform"]: Refreshing state... [id=terraform]
module.kubernetes.module.infinity-gauntlet.module.nodes.module.netboot.minio_s3_object.node_k3os_config["soul"]: Refreshing state... [id=config/e4:5f:01:05:41:72.yaml]
module.kubernetes.module.infinity-gauntlet.module.services.module.github-actions-runners.kubernetes_namespace.namespace: Refreshing state... [id=actions-runner-system]
module.synology.module.minio.minio_iam_user.user["state_infinity_gauntlet_etcd"]: Refreshing state... [id=state-infinity-gauntlet-etcd]
module.synology.module.minio.minio_iam_user.user["state_infinity_gauntlet_longhorn"]: Refreshing state... [id=state-infinity-gauntlet-longhorn]
module.synology.module.minio.minio_iam_user.user["state_infinity_gauntlet_prometheus"]: Refreshing state... [id=state-infinity-gauntlet-prometheus]
module.synology.module.minio.minio_iam_user.user["tftp_netboot_infinity_gauntlet"]: Refreshing state... [id=tftp-netboot-infinity-gauntlet]
module.kubernetes.module.infinity-gauntlet.module.services.module.cert-manager.helm_release.cert-manager: Refreshing state... [id=cert-manager]
module.kubernetes.module.infinity-gauntlet.module.services.module.pi-hole-exporter.kubernetes_secret.configuration: Refreshing state... [id=pi-hole-exporter/pi-hole]
module.kubernetes.module.infinity-gauntlet.module.services.module.prometheus.helm_release.prometheus: Refreshing state... [id=prometheus]
module.synology.module.minio.minio_iam_policy.policy_global["state_infinity_gauntlet_prometheus"]: Refreshing state... [id=state-infinity-gauntlet-prometheus-89d357e66b8535cf2bc464679a9edc8b]
module.synology.module.minio.minio_iam_policy.policy_global["state_infinity_gauntlet_longhorn"]: Refreshing state... [id=state-infinity-gauntlet-longhorn-89d357e66b8535cf2bc464679a9edc8b]
module.synology.module.minio.minio_iam_policy.policy_global["state_infinity_gauntlet_etcd"]: Refreshing state... [id=state-infinity-gauntlet-etcd-89d357e66b8535cf2bc464679a9edc8b]
module.synology.module.minio.minio_iam_policy.policy_global["tftp_netboot_infinity_gauntlet"]: Refreshing state... [id=tftp-netboot-infinity-gauntlet-89d357e66b8535cf2bc464679a9edc8b]
module.synology.module.minio.minio_iam_policy.policy["state_infinity_gauntlet_etcd"]: Refreshing state... [id=state-infinity-gauntlet-etcd-b7e1c7219c68f66fca69407033834ccc]
module.synology.module.minio.minio_iam_policy.policy["state_infinity_gauntlet_prometheus"]: Refreshing state... [id=state-infinity-gauntlet-prometheus-76c65925919ddc6d7883f7a8c9ecfddb]
module.synology.module.minio.minio_iam_policy.policy["tftp_netboot_infinity_gauntlet"]: Refreshing state... [id=tftp-netboot-infinity-gauntlet-7eb59e69950e7707143160eee63051c7]
module.synology.module.minio.minio_iam_policy.policy["state_infinity_gauntlet_longhorn"]: Refreshing state... [id=state-infinity-gauntlet-longhorn-0e2d8692356ab8c3d8507ae269f29b80]
module.kubernetes.module.infinity-gauntlet.module.services.module.github-actions-runners.kubernetes_secret.controller_authentication_configuration: Refreshing state... [id=actions-runner-system/controller-manager]
module.kubernetes.module.infinity-gauntlet.module.services.module.pi-hole-exporter.helm_release.pi-hole-exporter: Refreshing state... [id=pi-hole-exporter]
module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment_global["state_infinity_gauntlet_etcd"]: Refreshing state... [id=state-infinity-gauntlet-etcd-20211006181725500900000001]
module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment_global["state_infinity_gauntlet_longhorn"]: Refreshing state... [id=state-infinity-gauntlet-longhorn-20211006181725602500000003]
module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment_global["tftp_netboot_infinity_gauntlet"]: Refreshing state... [id=tftp-netboot-infinity-gauntlet-20211006181725517000000002]
module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment_global["state_infinity_gauntlet_prometheus"]: Refreshing state... [id=state-infinity-gauntlet-prometheus-20211006175325229200000003]
module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment["state_infinity_gauntlet_prometheus"]: Refreshing state... [id=state-infinity-gauntlet-prometheus-20211006181725606700000004]
module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment["state_infinity_gauntlet_etcd"]: Refreshing state... [id=state-infinity-gauntlet-etcd-20211006175325226500000002]
module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment["tftp_netboot_infinity_gauntlet"]: Refreshing state... [id=tftp-netboot-infinity-gauntlet-20211006175325229200000004]
module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment["state_infinity_gauntlet_longhorn"]: Refreshing state... [id=state-infinity-gauntlet-longhorn-20211006175325225900000001]
module.kubernetes.module.infinity-gauntlet.module.services.module.github-actions-runners.helm_release.github-actions-runner-controller: Refreshing state... [id=actions-runner-controller]
module.kubernetes.module.infinity-gauntlet.module.services.module.github-actions-runners.kubernetes_manifest.runner_deployment["tf"]: Refreshing state...
module.kubernetes.module.infinity-gauntlet.module.services.module.github-actions-runners.kubernetes_manifest.runner_deployment["zt"]: Refreshing state...
module.kubernetes.module.infinity-gauntlet.module.services.module.github-actions-runners.kubernetes_manifest.runner_deployment_autoscaler["tf"]: Refreshing state...
module.kubernetes.module.infinity-gauntlet.module.services.module.github-actions-runners.kubernetes_manifest.runner_deployment_autoscaler["zt"]: Refreshing state...

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.kubernetes.module.infinity-gauntlet.module.services.module.longhorn.helm_release.longhorn has been deleted
  - resource "helm_release" "longhorn" {
      - atomic                     = true -> null
      - chart                      = "longhorn" -> null
      - cleanup_on_fail            = false -> null
      - create_namespace           = true -> null
      - dependency_update          = false -> null
      - disable_crd_hooks          = false -> null
      - disable_openapi_validation = false -> null
      - disable_webhooks           = false -> null
      - force_update               = false -> null
      - id                         = "longhorn" -> null
      - lint                       = false -> null
      - max_history                = 0 -> null
      - metadata                   = [
          - {
              - app_version = "v1.2.0"
              - chart       = "longhorn"
              - name        = "longhorn"
              - namespace   = "longhorn-system"
              - revision    = 1
              - values      = "null"
              - version     = "1.2.0"
            },
        ] -> null
      - name                       = "longhorn" -> null
      - namespace                  = "longhorn-system" -> null
      - recreate_pods              = false -> null
      - render_subchart_notes      = true -> null
      - replace                    = false -> null
      - repository                 = "https://charts.longhorn.io" -> null
      - reset_values               = false -> null
      - reuse_values               = false -> null
      - skip_crds                  = false -> null
      - status                     = "deployed" -> null
      - timeout                    = 900 -> null
      - verify                     = false -> null
      - version                    = "1.2.0" -> null
      - wait                       = true -> null
      - wait_for_jobs              = false -> null
    }
  # module.synology.module.minio.minio_iam_policy.policy_global["tftp_netboot_infinity_gauntlet"] has been changed
  ~ resource "minio_iam_policy" "policy_global" {
        id     = "tftp-netboot-infinity-gauntlet-89d357e66b8535cf2bc464679a9edc8b"
        name   = "tftp-netboot-infinity-gauntlet-89d357e66b8535cf2bc464679a9edc8b"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action   = [
                          - "s3:ListAllMyBuckets",
                            "s3:GetBucketLocation",
                          + "s3:ListAllMyBuckets",
                        ]
                        # (2 unchanged elements hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
    }
  # module.synology.module.minio.minio_iam_policy.policy_global["state_infinity_gauntlet_etcd"] has been changed
  ~ resource "minio_iam_policy" "policy_global" {
        id     = "state-infinity-gauntlet-etcd-89d357e66b8535cf2bc464679a9edc8b"
        name   = "state-infinity-gauntlet-etcd-89d357e66b8535cf2bc464679a9edc8b"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action   = [
                          - "s3:GetBucketLocation",
                            "s3:ListAllMyBuckets",
                          + "s3:GetBucketLocation",
                        ]
                        # (2 unchanged elements hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
    }
  # module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment["state_infinity_gauntlet_longhorn"] has been changed
  ~ resource "minio_iam_user_policy_attachment" "policy_attachment" {
        id          = "state-infinity-gauntlet-longhorn-20211006175325225900000001"
      ~ policy_name = "state-infinity-gauntlet-longhorn-0e2d8692356ab8c3d8507ae269f29b80" -> "state-infinity-gauntlet-longhorn-89d357e66b8535cf2bc464679a9edc8b"
        # (1 unchanged attribute hidden)
    }
  # module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment["tftp_netboot_infinity_gauntlet"] has been changed
  ~ resource "minio_iam_user_policy_attachment" "policy_attachment" {
        id          = "tftp-netboot-infinity-gauntlet-20211006175325229200000004"
      ~ policy_name = "tftp-netboot-infinity-gauntlet-7eb59e69950e7707143160eee63051c7" -> "tftp-netboot-infinity-gauntlet-89d357e66b8535cf2bc464679a9edc8b"
        # (1 unchanged attribute hidden)
    }
  # module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment["state_infinity_gauntlet_etcd"] has been changed
  ~ resource "minio_iam_user_policy_attachment" "policy_attachment" {
        id          = "state-infinity-gauntlet-etcd-20211006175325226500000002"
      ~ policy_name = "state-infinity-gauntlet-etcd-b7e1c7219c68f66fca69407033834ccc" -> "state-infinity-gauntlet-etcd-89d357e66b8535cf2bc464679a9edc8b"
        # (1 unchanged attribute hidden)
    }
  # module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment_global["state_infinity_gauntlet_prometheus"] has been changed
  ~ resource "minio_iam_user_policy_attachment" "policy_attachment_global" {
        id          = "state-infinity-gauntlet-prometheus-20211006175325229200000003"
      ~ policy_name = "state-infinity-gauntlet-prometheus-89d357e66b8535cf2bc464679a9edc8b" -> "state-infinity-gauntlet-prometheus-76c65925919ddc6d7883f7a8c9ecfddb"
        # (1 unchanged attribute hidden)
    }
  # module.synology.module.minio.minio_iam_policy.policy["state_infinity_gauntlet_longhorn"] has been changed
  ~ resource "minio_iam_policy" "policy" {
        id     = "state-infinity-gauntlet-longhorn-0e2d8692356ab8c3d8507ae269f29b80"
        name   = "state-infinity-gauntlet-longhorn-0e2d8692356ab8c3d8507ae269f29b80"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = [
                          - "arn:aws:s3:::state-infinity-gauntlet-longhorn",
                            "arn:aws:s3:::state-infinity-gauntlet-longhorn/*",
                          + "arn:aws:s3:::state-infinity-gauntlet-longhorn",
                        ]
                        # (2 unchanged elements hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
    }
  # module.synology.module.minio.minio_iam_policy.policy["state_infinity_gauntlet_prometheus"] has been changed
  ~ resource "minio_iam_policy" "policy" {
        id     = "state-infinity-gauntlet-prometheus-76c65925919ddc6d7883f7a8c9ecfddb"
        name   = "state-infinity-gauntlet-prometheus-76c65925919ddc6d7883f7a8c9ecfddb"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = [
                          - "arn:aws:s3:::state-infinity-gauntlet-prometheus",
                            "arn:aws:s3:::state-infinity-gauntlet-prometheus/*",
                          + "arn:aws:s3:::state-infinity-gauntlet-prometheus",
                        ]
                        # (2 unchanged elements hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment["state_infinity_gauntlet_etcd"] must be replaced
-/+ resource "minio_iam_user_policy_attachment" "policy_attachment" {
      ~ id          = "state-infinity-gauntlet-etcd-20211006175325226500000002" -> (known after apply)
      ~ policy_name = "state-infinity-gauntlet-etcd-89d357e66b8535cf2bc464679a9edc8b" -> "state-infinity-gauntlet-etcd-b7e1c7219c68f66fca69407033834ccc" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment["state_infinity_gauntlet_longhorn"] must be replaced
-/+ resource "minio_iam_user_policy_attachment" "policy_attachment" {
      ~ id          = "state-infinity-gauntlet-longhorn-20211006175325225900000001" -> (known after apply)
      ~ policy_name = "state-infinity-gauntlet-longhorn-89d357e66b8535cf2bc464679a9edc8b" -> "state-infinity-gauntlet-longhorn-0e2d8692356ab8c3d8507ae269f29b80" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment["tftp_netboot_infinity_gauntlet"] must be replaced
-/+ resource "minio_iam_user_policy_attachment" "policy_attachment" {
      ~ id          = "tftp-netboot-infinity-gauntlet-20211006175325229200000004" -> (known after apply)
      ~ policy_name = "tftp-netboot-infinity-gauntlet-89d357e66b8535cf2bc464679a9edc8b" -> "tftp-netboot-infinity-gauntlet-7eb59e69950e7707143160eee63051c7" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment_global["state_infinity_gauntlet_prometheus"] must be replaced
-/+ resource "minio_iam_user_policy_attachment" "policy_attachment_global" {
      ~ id          = "state-infinity-gauntlet-prometheus-20211006175325229200000003" -> (known after apply)
      ~ policy_name = "state-infinity-gauntlet-prometheus-76c65925919ddc6d7883f7a8c9ecfddb" -> "state-infinity-gauntlet-prometheus-89d357e66b8535cf2bc464679a9edc8b" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.kubernetes.module.infinity-gauntlet.module.services.module.chaoskube.helm_release.chaoskube will be created
  + resource "helm_release" "chaoskube" {
      + atomic                     = true
      + chart                      = "chaoskube"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "chaoskube"
      + namespace                  = "chaoskube"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://chaoskube.github.io/chaoskube-kubernetes"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 900
      + verify                     = false
      + version                    = (known after apply)
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name = "chaoskube.args.annotations"
        }
      + set {
          + name = "chaoskube.args.excluded-times-of-day"
        }
      + set {
          + name = "chaoskube.args.excluded-weekdays"
        }
      + set {
          + name = "chaoskube.args.kinds"
        }
      + set {
          + name = "chaoskube.args.labels"
        }
      + set {
          + name = "chaoskube.args.namespaces"
        }
      + set {
          + name  = "replicaCount"
          + value = "2"
        }
      + set {
          + name  = "resources.limits.cpu"
          + value = "25m"
        }
      + set {
          + name  = "resources.limits.memory"
          + value = "32Mi"
        }
      + set {
          + name  = "resources.requests.cpu"
          + value = "25m"
        }
      + set {
          + name  = "resources.requests.memory"
          + value = "32Mi"
        }
    }

  # module.kubernetes.module.infinity-gauntlet.module.services.module.longhorn.helm_release.longhorn will be created
  + resource "helm_release" "longhorn" {
      + atomic                     = true
      + chart                      = "longhorn"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "longhorn"
      + namespace                  = "longhorn-system"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.longhorn.io"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 900
      + verify                     = false
      + version                    = "1.2.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

Plan: 6 to add, 0 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>